import os
import sys

# =====================================================================
# 1. 环境依赖配置：指定本地部署的 YOLOv5 官方源码仓储路径
# =====================================================================
YOLO5_REPO = r"E:\pythonDemo\yolo5\yolov5-master"

# 验证源码依赖项完整性，并切换物理工作目录
if os.path.exists(YOLO5_REPO):
    os.chdir(YOLO5_REPO)
else:
    print(f"[ERROR] 未能定位指定的 YOLOv5 源码仓储路径: {YOLO5_REPO}")
    sys.exit(1)

# =====================================================================
# 2. 硬件环境优化：配置显存动态分配机制，规避 OOM 异常
# =====================================================================
os.environ["PYTORCH_CUDA_ALLOC_CONF"] = "expandable_segments:True"

# =====================================================================
# 3. 显式配置硬编码物理路径（纯手动指定，不搞动态推导）
# =====================================================================
DATA_YAML = r"G:\桌面\深度学习项目\第六组-基于YOLOv5的城市道路车辆类别与行人检测\项目源代码\配置文件\traffic_data.yaml"
HYP_YAML = r"G:\桌面\深度学习项目\第六组-基于YOLOv5的城市道路车辆类别与行人检测\项目源代码\配置文件\hyp.traffic_extreme_aug.yaml"
OUTPUT_PROJECT = r"G:\桌面\深度学习项目\第六组-基于YOLOv5的城市道路车辆类别与行人检测\项目源代码"

# =====================================================================
# 4. 构建标准训练指令
# =====================================================================
cmd = (
    f"python train.py "
    f"--img 640 "
    f"--batch 16 "
    f"--epochs 500 "
    f"--data \"{DATA_YAML}\" "
    f"--hyp \"{HYP_YAML}\" "
    f"--weights yolov5m.pt "
    # f"--optimizer AdamW "
    f"--device 0 "
    f"--workers 2 "
    f"--cache ram "
    f"--project \"{OUTPUT_PROJECT}\" "
    f"--name 权重文件 "
    f"--patience 100 "
    f"--multi-scale "                 # 激活多尺度训练算法，兼顾大巴与长尾小目标精度        
    f"--exist-ok"
)

# 输出标准化运行状态日志
print("--------------------------------------------------------------------------------")
print("[PROJECT INFO] 第六组：基于 YOLOv5 的城市道路车辆类别与行人检测项目训练程序启动")
print(f"[OUTPUT DIR]   产物输出目标目录 ➔ {OUTPUT_PROJECT}\\权重文件")
print("--------------------------------------------------------------------------------\n")
print(f"[EXECUTE COMMAND]: {cmd}\n")

# 调用底层系统内核，拉起模型训练微调流
os.system(cmd)